# General instructions
- Install the package `Pandas` in your course-specific virtual environment, if you have not done so already.
- Store the data file `titanic.csv` either in the same directory as the current Jupyter notebook, or in a subdirectory named `data`.
- Read in the data set 'titanic.csv' as a Pandas DataFrame. 
- Answer the questions below, and other questions that may arise in the process.

Note that the source of the data set is [Encyclopedia Titanica](https://www.encyclopedia-titanica.org/). Several preprocessing steps have been carried out on the raw dataset. Note that there is also a (less complete) variant of the data set available via the Python package `seaborn`.

There may be occasional problems or errors in the data (unplausible, wrong, ...). If you find some error or strange anomaly, then please give me a hint, so that I can further curate the dataset for the future.

In [13]:
import pandas as pd

In [14]:
df = pd.read_csv('titanic.csv')
df.head()

,first_name,family_name,type,ticket_number,pclass,departure,price,survived,lifeboat,body_no,...,gender,age,marital_status,number_relatives_onboard,home_location,destination,age_at_death,occupation,department,works_for
0,Luka,Orešković,Passenger,315094.0,3rd Class Passengers,Southampton,8.0,False,NaN,NaN,...,Male,20.0,Married,3,"Konjsko Brdo, Croatia [Austria-Hungary]","Chicago, Illinois, United States",20.0,Farmer,NaN,NaN
1,Joseph Francis,Akerman,Crew,NaN,NaN,Southampton,NaN,False,NaN,NaN,...,Male,37.0,Married,1,"Southampton, Hampshire, England",NaN,37.0,Assistant Pantryman Steward,Victualling Crew,White Star Line
2,Mary Elizabeth,Davison,Passenger,386525.0,3rd Class Passengers,Southampton,16.0,True,boat 10,NaN,...,Female,34.0,Married,2,"Liverpool, Lancashire, England","Bedford, Ohio, United States",61.0,NaN,NaN,NaN
3,Ernest Edward Samuel,Freeman,Crew,NaN,NaN,Belfast,NaN,False,NaN,NaN,...,Male,45.0,Married,1,"Southampton, Hampshire, England",NaN,NaN,Deck Steward (1st Class),Victualling Crew,White Star Line
4,George Alfred,Levett,Crew,NaN,NaN,Belfast,NaN,False,NaN,NaN,...,Male,25.0,Married,2,"Southampton, Hampshire, England",NaN,25.0,Assistant Pantryman Steward (1st Class),Victualling Crew,White Star Line

# 1. Traveler type

How many crew members and how many passengers are recorded in the dataset?

In [20]:
# Anzahl der Crew-Mitglieder und Passagiere
crew_count = df[df["type"] == "Crew"].shape[0]
passenger_count = df[df["type"] == "Passenger"].shape[0]

crew_count, passenger_count

(1122, 1352)

Sort the dataset permanently according to traveler type (crew vs. passenger) and lastname?

How many crew members died?

# 2. Lifeboats

Which were the 5 boats that saved the largest number of people?

How many lifeboats were there in total?

Which lifeboats saved the largest number of male passengers?

Which lifeboats saved the largest proportion of male adult passengers?

What was the average number of people saved on lifeboats?

Which boats saved in particular people from the 1st (2nd, 3rd) class?

What was the average age of rescued people, by lifeboat?

What was the (1) average age, and the number of people saved by lifeboat? (Note: Calculate this in one single query)

# 2. Investigation of ticket prices
The prices are given in British Pounds. 1 British Pound at that time corresponds to 161 US Dollar today. And 1 US Dollar corresponds currently to 0.90 Euro. Please convert the original fares to current day Euros, and store it in a new column.

Are the prices provided in the data the prices paid by person, or the prices paid by ticket (potentially covering multiple people)? Carry out a detailed data analysis to answer this question.

What are other interesting patterns related to the prices paid? Freely explore!

# 3. Freely Explore